#include <array>

namespace JPN {
	//0x10F898 - string pointers array
	//0x133430 - replacement pointer
	std::array CHAPTER_TITLES = {
		"AUG",
		"Aqua Stripe",
		"沈黙の海",
		"航路",
		"Separation",
		"Without Two",
		"暗闇の中の死角",
		"calculation",
		"海の底",
		"スリーピング・ドール",
		"盤上の夜",
		"告白",
		"Blue Regret",
		"予告された殺人の記憶",
		"幸福な食卓",
		"嘘をもうひとつだけ",
		"嘘",
		"消失グラデーション",
		"約束の地",
		"華竜の宮",
		"蜘蛛の糸",
		"少女",
		"ネズミとレバー",
		"捕獲",
		"マリアの指",
		"in the dark",
		"使命",
		"太陽黒点",
		"プライドと偏見",
		"種の起源",
		"影",
		"救助船",
		"node",
		"Artificial Selection",
		"混迷",
		"幽霊船",
		"経路",
		"rhythm",
		"Deontology",
		"起こったかもしれないこと",
		"空白",
		"光明",
		"Der bestirnte Himmel",
		"第三の棺",
		"spear",
		"たったひとつの",
		"infection",
		"黄泉から",
		"色の研究",
		"奪還",
		"Holy ground",
		"shortage",
		"Stay",
		"Godless",
		"いちばん初めにあった海",
		"人為選択",
		"電磁気の理論",
		"生命の境界",
		"笹船",
		"Steam",
		"論理爆弾",
		"逃れの町",
		"Sacrifice",
		"アリス",
		"夏の王国で目覚めない",
		"Neglect",
		"罪人の舟",
		"繭の夏",
		"天秤",
		"閉じ箱",
		"1/2",
		"オイディプス症候群",
		"Just the Two of Us",
		"Another",
		"ボトルネック",
		"凶鳥の黒影",
		"時限爆弾",
		"海にいるのは人魚ではない",
		"クリスタル・ゲージ",
		"知の探求",
		"眠り姫",
		"ABYSS",
		"第五の日",
		"the Colour Out Of Space",
		"Cry",
		"覚醒のための",
		"デイ・グラシア",
		"大いなる眠り",
		"名状しがたき",
		"瓶の中の手紙",
		"失われた時",
		"messenger",
		"神託機械",
		"海の温度は",
		"冷たいオゾン",
		"たった二つの冴えたやり方",
		"祈るにはまだ",
		"罪",
		"水のない晴れた海へ",
		"Exodus",
		"UAG",
		"EXTRA STORY 縁",
		"EXTRA STORY 柊乃",
		"EXTRA STORY 灯理",
		"EXTRA STORY 黎理",
		"EXTRA STORY ときわ",
		"EXTRA STORY 光理"
	};

	std::array SAVE_EXIT = {
		"ゲームを終了してタイトル画面へ戻ります",
		"セーブを行っていない場合、現在プレイ中のデータは失われます",
		"よろしいですか？"	
	};

	//0x10FBF8 - string array
	//0x133A20 - replacement pointer
	std::array NOTIFICATIONS = {
		"記録メディアの空き容量が不足しています。",
		"セーブするには%s以上の空き容量が必要です。",
		"ゲームを開始してもよろしいですか？",
		//
		"メモリースティックが挿入されていません。",
		"セーブするには%s以上の空き容量が必要です。",
		"ゲームを開始してもよろしいですか？",
		//
		"セーブデータが破損している可能性があります。",
		"セーブするには%s以上の空き容量が必要です。",
		"ゲームを開始してもよろしいですか？",
		//
		"メモリースティックが挿入されていません。",
		"もう一度チェックしますか？",
		"",
		//
		"セーブデータが破損している可能性があります。",
		"もう一度チェックしますか？",
		"",
		//
		"「\"TITLE_NAME L\"」の",
		"セーブデータがありません。",
		"もう一度チェックしますか？",
		//
		"メモリースティックが挿入されていません。",
		"セーブするには%s以上の空き容量が必要です。",
		"もう一度チェックしますか？",
		//
		"セーブデータが破損している可能性があります。",
		"このままセーブを行うと破損データに上書きすることになりますが、",
		"よろしいですか？",
		//
		"システムデータをセーブしますか？",
		"",
		"",
		//
		"処理が中断されました。",
		"",
		"",
		//
		"システムデータをロードしますか？",
		"",
		"",
		//
		"システムデータをロードしました。"
		"",
		"",
		//
		"サインインされていないため、セーブを行うことは出来ません。",
		"セーブを行うには、サインインを行ってください。",
		"",
		//
		"サインインされていないため、ロードを行うことは出来ません。",
		"ロードを行うには、サインインを行ってください。",
		"",
		//
		"ストレージデバイスが選択されていないため、",
		"セーブを行うことは出来ません。セーブを行うには、",
		"ゲームを再起動してストレージデバイスを選択してください。",
		//
		"ストレージデバイスが選択されていないため、",
		"ロードを行うことは出来ません。ロードを行うには、",
		"ゲームを再起動してストレージデバイスを選択してください。",
		//
		"データを上書きしてもよろしいですか？",
		"",
		"",
		//
		"データのセーブに失敗しました。",
		"もう一度セーブを行ってください。",
		"",
		//
		"セーブデータが破損しています。",
		"セーブデータのロードに失敗しました。",
		"",
		//
		"データをロードします。",
		"セーブを行っていない場合、現在プレイ中のデータは失われます。",
		"よろしいですか？",
		//
		"セーブデータを消去し、最初から『ゲーム』をやり直すことができます。",
		"消去したセーブデータの復旧は行えません。",
		"本当にセーブデータを消去しますか？"
	};

	std::array YES_NO = {
		"はい",
		"いいえ",
		"はい／いいえ",
		"はい／"
	};

	std::array QUICK_SAVE = {
		"現在の状態をクイックセーブして、選択した箇所から",
		"再スタートします。よろしいですか？"
	};

	//0x10D170 - strings pointer
	//0x133418 - replacement pointer
	std::array PLAYING_LOG_MAIN = {
		"エンディング達成数",
		"シーンタイトル達成数",
		"ミュージック完成度",
		"メッセージ既読数"
	};

	//0x10F3C0 - string array
	//0x133838 - replacement pointer
	std::array MUSIC = {
		"沈んだあとには何もない",
		"あかいうみ",
		"海が見える",
		"meeting",
		"meeting",
		"meeting",
		"暖流",
		"水面",
		"水面",
		"切迫",
		"おしゃべり",
		"おしゃべり",
		"おふざけ",
		"告白",
		"暗い船内",
		"暗い船内",
		"もし、、なら",
		"fact",
		"過去",
		"回遊",
		"深海",
		"錯綜",
		"錯綜",
		"錯綜",
		"creature",
		"creature",
		"attack",
		"attack",
		"aimless",
		"aimless",
		"戦い",
		"Exod.",
		"invisible disaster",
		"ellipse jail",
		""
	};

	//0x10F4D8 - string array
	//0x133868 - replacement pointer
	std::array SETTINGS_DESCRIPTIONS = {
		"ゲーム中で表示されるメッセージの、表示領域の不透明度を変更します。%N%N『透明』の方に設定するほど、%Nウィンドウが透ける度合いが大きくなります。%N%N『濃い』の方に設定するほど、%Nウィンドウが透ける度合いが小さくなります。",
		"ゲーム中に表示されるメッセージの速度を変更します。%N%N『Ｍｉｎ』の方に設定するほど、表示される速度が遅くなります。%N『Ｍａｘ』の方に設定するほど、表示される速度が速くなります。%N最大に設定すると、１文字ずつの表示ではなく、一括表示となります。",
		"ゲーム中に表示される選択肢の文字色を、選んだことがあるかどうかで変更します。%N%N『ＯＮ』に設定すると、選んだことがある選択肢の文字が赤色に変更されます。%N%N『ＯＦＦ』に設定すると、文字色は変更されません。",
		"ゲーム中に表示されるメッセージを送るボタンを設定します。%N%N『Ａボタン』に設定すると、Ａボタンでのみメッセージ送りをする事ができます。%N%N『Ａボタン/方向ボタン』に設定すると、Ａボタンだけでなく方向ボタンやスティックでメッセージを送ることができます。",
		"オートモード時のメッセージが送られる速度を設定します。%N%N『Ｍｉｎ』の方に設定するほど、メッセージが送られるまでの待ち時間が長くなります。%N%N『Ｍａｘ』の方に設定するほど、メッセージが送られるまでの待ち時間が短くなります。",
		"ＺＲボタンを押した時のスキップ機能の設定をします。%N%N『既読のみ』に設定すると、過去に表示したことがあるメッセージのみスキップし、一度も表示したことがないメッセージはスキップしません。%N%N『すべて』に設定すると、過去の表示に関係なくメッセージをスキップします。",
		"Ｒボタンを押してスキップモードになった時の、スキップ機能の設定をします。%N%N『既読のみ』に設定すると、過去に表示したことがあるメッセージのみスキップし、一度も表示したことがないメッセージはスキップしません。%N%N『すべて』に設定すると、過去の表示に関係なくメッセージをスキップします。",
		"シーンが変わった際にシーンタイトルを表示するか設定します。%N%N『ＯＮ』に設定すると、シーンが変わった際にそのシーンのタイトルが表示されます。%N%N『ＯＦＦ』に設定すると、シーンが変わってもタイトルは表示されません。",
		"ゲーム中に流れるＢＧＭのボリュームを設定します。%N%N『Ｍｉｎ』の方に設定するほど、小さな音で再生されます。%N%N『Ｍａｘ』の方に設定するほど、大きな音で再生されます。",
		"ゲーム中に流れるＳＥのボリュームを設定します。%N%N『Ｍｉｎ』の方に設定するほど、小さな音で再生されます。%N%N『Ｍａｘ』の方に設定するほど、大きな音で再生されます。",
		"操作をした時に再生されるＳＥのボリュームを設定します。%N%N『Ｍｉｎ』の方に設定するほど、小さな音で再生されます。%N%N『Ｍａｘ』の方に設定するほど、大きな音で再生されます。"
	};

	char SAVING[] = "保存中…";

	char CUSTOM_NAME[] = "%s%s様でよろしいですか？";

	std::array NAME_PROMPT = {
		"お名前をご入力ください",
		"姓：",
		"名："
	};

	std::array NAME_ERROR = {
		"名が空白です。もう一度ご記入ください。",
		"姓が空白です。もう一度ご記入ください。",
		"その名前は使用できません。もう一度ご記入ください。",
		"'%s'の文字は使えません。もう一度ご記入ください。"
	};

	std::array MC_NAME = {
		"片桐",
		"一葉"
	};

	std::array ENDINGS = {
		"エンディング１",
		"エンディング２",
		"エンディング３"
	};
}